# Week_12 Challenge

### Q1. Create a database called temp_db. Open a cursor to this newly created database.

In [67]:
import sqlite3

In [68]:
# creating a database connection 
con = sqlite3.connect("temp.db")
# Opening cursor 
cur = con.cursor()
con.close()

# ---------------------------------------------------------------------------------------------------------------

### Q2. In the database temp_db created in Q.No.1, create a table called emp with the attributes empno, ename, salary and deptno\

In [69]:
# creating table attributes 

con = sqlite3.connect('temp.db')
cur = con.cursor()
cur.execute("CREATE TABLE IF NOT EXISTS emp (empno INT , ename TEXT , salary INT , deptno INT)")
con.close()

# ---------------------------------------------------------------------------------------------------------------

### Q3.In the emp table created in Q.No. 2, insert any five records.

In [70]:
# inserting records into table( here we can only give 4 values because we have created table using 4 value previously)
def insert(r,n,s,d) : 
    con = sqlite3.connect('temp.db')
    cur = con.cursor()
    cur.execute("INSERT INTO emp values (?,?,?,?)",(r,n,s,d))
    con.commit()
    con.close()

# inserting records 

insert(101,'Vinayak',25000,30)
insert(102,'Ramesh',22000,3) # 
insert(104,'Ganesh',27000,2)
insert(106,'Kamlesh',28000,10) #
insert(107,'Mangesh',28000,10)  #

# ---------------------------------------------------------------------------------------------------------------

### Q4. From the emp table, display all the records.

In [71]:
def view() : 
    con = sqlite3.connect("temp.db")
    cur = con.cursor()
    cur.execute("SELECT * FROM emp")
    data = cur.fetchall()
    con.commit()
    con.close()
    return data
view()

[(101, 'Vinayak', 25000, 30),
 (102, 'Ramesh', 22000, 3),
 (104, 'Ganesh', 27000, 2),
 (106, 'Kamlesh', 28000, 10),
 (107, 'Mangesh', 28000, 10)]

# ---------------------------------------------------------------------------------------------------------------

### Q5.From the emp table, display the records of only those employees whose salary is greater than 15000 and who belong to deptno 10

In [72]:
con = sqlite3.connect("temp.db")
cur = con.cursor()
cur.execute('SELECT * FROM emp where salary > 1500 and deptno = 10 ')
data = cur.fetchall()
con.close()
print(data)

[(106, 'Kamlesh', 28000, 10), (107, 'Mangesh', 28000, 10)]

# --------------------------------------------------------------------------------------------------------------

### Q6.From the emp table, display the records of only those employees whose salary lies between 20000 and 25000 and who do not belong to the deptno 10

In [73]:
con = sqlite3.connect('temp.db')
cur = con.cursor()
cur.execute('SELECT *FROM emp where salary > 20000 and salary < 25000 and deptno != 10')
data = cur.fetchall()
con.close()

print(data)

[(102, 'Ramesh', 22000, 3)]

# -------------------------------------------------------------------------------------------------------------

### Q7. From the emp table, display the records of only those employees whose name begins with M.

In [74]:
con = sqlite3.connect('temp.db')
cur = con.cursor()
cur.execute("SELECT ename, substr(ename,1,1)   FROM emp where substr(ename,1,1) = 'M' ")
data = cur.fetchall()
con.close()
print(data)

[('Mangesh', 'M')]

# ---------------------------------------------------------------------------------------------------------------

### Q8. In the emp table, delete the records of those employees who belong to deptno 30

In [75]:
# Here intentionally i didnt made delete function because function is not mentioned in question 
con = sqlite3.connect('temp.db')
cur = con.cursor()
cur.execute('DELETE FROM emp where deptno = 30 ')
con.commit()
con.close()

view()

[(102, 'Ramesh', 22000, 3),
 (104, 'Ganesh', 27000, 2),
 (106, 'Kamlesh', 28000, 10),
 (107, 'Mangesh', 28000, 10)]

# ---------------------------------------------------------------------------------------------------------------

### Q9. In the emp table, update the salary of an employee by 10 % by accepting the empno from the user.

In [76]:
def update(en) : 
    con = sqlite3.connect('temp.db')
    cur = con.cursor()
    cur.execute('UPDATE emp SET salary = 1.1 * salary where empno = ? ',(en,))
    con.commit()
    con.close()
    


update(106)
view()

[(102, 'Ramesh', 22000, 3),
 (104, 'Ganesh', 27000, 2),
 (106, 'Kamlesh', 30800.000000000004, 10),
 (107, 'Mangesh', 28000, 10)]

# ---------------------------------------------------------------------------------------------------------------

### Q10. Delete the emp table.

In [77]:
con = sqlite3.connect('temp.db')
cur = con.cursor()
cur.execute('DROP TABLE emp')
con.close()

view()

OperationalError: no such table: emp